constant/neutroRegion/neutronicsProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      neutronicsProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

SP3Neutronics           false; //for SP3 instead of diffusion (no accelerations available for the moment)

eigenvalueNeutronics    true;

fastNeutrons            true; // if true interpolates cross section with logarithmic temp for fuel (otherwise, square root)

adjustDiscFactors       false;

//groupsWoDF              (0 1 2 3 4 5 6 7 8 9 14 15 16 17 18 19 20 21 22 23);

useGivenDiscFactors     false;

//doNotParametrize        ();

// ************************************************************************* //
