system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


// General

application     GeN-ROM;

startFrom       startTime;//latestTime;//

startTime      0;

stopAt       endTime;//writeNow;//  

endTime        0.2;

deltaT          0.2; // time step (if non adjusted)

adjustTimeStep  false; // adjust time step based on CFL condition, max power and max delta T

maxDeltaT	0.2; // max time step

writeControl   adjustableRunTime;//timeStep;//

writeInterval   0.2;

purgeWrite      0;

writeFormat     ascii;

writePrecision  10;

writeCompression on;

timeFormat      general;

timePrecision   8;

runTimeModifiable false;

// ************************************************************************* //
// Physics to solve

solveFluidMechanics  true;

solveEnergy  false;

solveNeutronics false;

eigenvalueNeutronics  false;

solveThermalMechanics  false;

// ************************************************************************* //
// Thermal-hydraulic options

compr false; // true for compressible simulation

liquidFuel	false; // eg, MSRs

// ************************************************************************* //
// Solution control

maxCo           0.99; // should be below 1 for CFL condition (necessary to guarantee stability if solving NS)

maxPowerVariation	0.025; //max power variation in each time step

// ************************************************************************* //




