system/fluidRegion/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default Euler;
}

gradSchemes
{
    default         Gauss linear;
//    default cellMDLimited Gauss linear 0.5;
//    default Gauss linear;
//    grad(U)             Gauss linear;
//    grad(p_rgh)         Gauss linear;
//    grad((rho*rhok))    Gauss linear;
//    grad(h)             Gauss linear;
}

divSchemes
{
      default         Gauss linear upwind;
//    default Gauss linear;
//    div(phi,U)          Gauss upwind;
//    div(phi,K)          Gauss linear;
//    div(phi,h)          Gauss upwind;
//    div(phi,k)          Gauss upwind;
//    div(phi,epsilon)    Gauss upwind;
//    div(phi,R)          Gauss upwind;
//    div(R)              Gauss linear;
//    div((muEff*dev2(T(grad(U)))))       Gauss linear;
//    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
//    default Gauss linear limited 1.0;
//    laplacian(muEff,U)      Gauss linear limited corrected 0.333;
//    laplacian(Dp,p_rgh)     Gauss linear limited corrected 0.333;
//    laplacian(alphaEff,h)   Gauss linear limited corrected 0.333;
//    laplacian(DkEff,k)      Gauss linear limited corrected 0.333;
//    laplacian(DepsilonEff,epsilon)  Gauss linear limited corrected 0.333;
//    laplacian(DREff,R)      Gauss linear limited corrected 0.333;
//    laplacian((rho*nuEff),U)        Gauss linear limited corrected 0.333;
//    laplacian(thermo:alpha,h)       Gauss linear limited corrected 0.333;
}

interpolationSchemes
{
    default         linear;
//    default linear;
//    interpolate(gamma)                  linear;
//    interpolate(((gamma*rho)*(1|A(U)))) linear;
//    dotInterpolate(S,(rho_0*U_0))       linear;
//    interpolate((rho*HbyA))             linear;
//    flux((rho*HbyA))                    linear;
}

snGradSchemes
{
    default         corrected;
//    default limited 1;
//    default limited corrected 0.333;
//    snGrad(p_rgh)       limited corrected 0.333;
//    snGrad((rho*rhok))  limited corrected 0.333;
}

fluxRequired
{
    default         no;
    p_rgh;
    Phi;
}

// ************************************************************************* //
