system/neutroRegion/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default Euler;
}

gradSchemes
{
    default Gauss linear;
    grad((DNeutro&(1,0,0))) Gauss linear;
    grad((DNeutro&(0,1,0))) Gauss linear;
    grad((DNeutro&(0,0,1))) Gauss linear;
    grad(fluxStar0)   Gauss linear;
    grad(fluxStar1)   Gauss linear;
    grad(fluxStar2)   Gauss linear;
    grad(fluxStar3)   Gauss linear;
    grad(fluxStar4)   Gauss linear;
    grad(fluxStar5)   Gauss linear;
    grad(prec0)        Gauss linear;
    grad(prec1)        Gauss linear;
    grad(prec2)        Gauss linear;
    grad(prec3)        Gauss linear;
    grad(prec4)        Gauss linear;
    grad(prec5)        Gauss linear;
    grad(prec6)        Gauss linear;
    grad(prec7)        Gauss linear;
}

divSchemes
{
    default Gauss upwind;
    div(phiNeutro,prec0)    Gauss upwind;
    div(phiNeutro,prec1)    Gauss upwind;
    div(phiNeutro,prec2)    Gauss upwind;
    div(phiNeutro,prec3)    Gauss upwind;
    div(phiNeutro,prec4)    Gauss upwind;
    div(phiNeutro,prec5)    Gauss upwind;
    div(phiNeutro,prec6)    Gauss upwind;
    div(phiNeutro,prec7)    Gauss upwind;
    div(phi,prec0)    Gauss upwind;
    div(phi,prec1)    Gauss upwind;
    div(phi,prec2)    Gauss upwind;
    div(phi,prec3)    Gauss upwind;
    div(phi,prec4)    Gauss upwind;
    div(phi,prec5)    Gauss upwind;
    div(phi,prec6)    Gauss upwind;
    div(phi,prec7)    Gauss upwind;
}

laplacianSchemes
{
    default Gauss linear uncorrected;
    laplacian((D0|discFactor0),fluxStar0)   Gauss linear uncorrected;
    laplacian((D1|discFactor1),fluxStar1)   Gauss linear uncorrected;
    laplacian((D2|discFactor2),fluxStar2)   Gauss linear uncorrected;
    laplacian((D3|discFactor3),fluxStar3)   Gauss linear uncorrected;
    laplacian((D4|discFactor4),fluxStar4)   Gauss linear uncorrected;
    laplacian((D5|discFactor5),fluxStar5)   Gauss linear uncorrected;
    laplacian(diffCoeffNeutro,prec0)        Gauss linear uncorrected;
    laplacian(diffCoeffNeutro,prec1)        Gauss linear uncorrected;
    laplacian(diffCoeffNeutro,prec2)        Gauss linear uncorrected;
    laplacian(diffCoeffNeutro,prec3)        Gauss linear uncorrected;
    laplacian(diffCoeffNeutro,prec4)        Gauss linear uncorrected;
    laplacian(diffCoeffNeutro,prec5)        Gauss linear uncorrected;
    laplacian(diffCoeffNeutro,prec6)        Gauss linear uncorrected;
    laplacian(diffCoeffNeutro,prec7)        Gauss linear uncorrected;
}

interpolationSchemes
{
    default none;//linear;
}

snGradSchemes
{
    default none;//uncorrected;
}

fluxRequired
{
    default false;
}
// ************************************************************************* //
