system/thermoMechanicalRegion/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    ".*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0.001;
/*
        solver          GAMG;
        tolerance       1e-06;
        relTol          0.001;
        smoother        GaussSeidel;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 50;
        agglomerator    faceAreaPair;
        mergeLevels     1;
	processorAgglomerator masterCoarsest; 
*/
    }
    "fuelDisp"
    {

        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-5;
        relTol          0.01;
    }
    "CRDisp"
    {

        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-5;
        relTol          0.01;
    }
}
stressAnalysis
{
    compactNormalStress yes;
    nCorrectors     3;
    D               1e-06;
}
relaxationFactors
{
    fields
    {
	Disp 0.99;

    }
}
// ************************************************************************* //
